//**** 声明 ********************************************************************
/*******************************************************************************
 * 下面来自互联开源程序，由深圳市大夏龙雀科技有限公司收集
 * 方便用户参考学习，本公司不提供任何技术支持
 * 程序仅供测试参考，不能应用在实际工程中，不一定能通过编译
 * 公司网站 http://www.szdx-smart.com/
 * 淘宝网址 https://shop184598174.taobao.com/?spm=a1z10.5-c-s.w12096189-21564973333.3.547b1176WCCDxR&scene=taobao_shop
*******************************************************************************/
/********************************************************************
* 文件名  ：  串口与蓝牙通信
* 描述    :  该文件实现通过单片机与蓝牙BT04-E02进行收发数据。
***********************************************************************/
/*
 Name:    uart.ino
 Created: 2022/5/31 
 Author:  zhong
*/


#include <SoftwareSerial.h>
//使用软件串口，能讲数字口模拟成串口
SoftwareSerial BT(8, 9);  //新建对象，接收脚为8，发送脚为9
char val;  //存储接收的变量

 
void setup() {
  Serial.begin(9600);   //与电脑的串口连接
  Serial.println("BT is ready!");
  BT.begin(9600);  //设置波特率
  

}
 
void loop() {
  //如果串口接收到数据，就输出到蓝牙串口
  if (Serial.available()) {
    val = Serial.read();
    BT.print(val);
  }
 
  //如果接收到蓝牙模块的数据，输出到屏幕
  if (BT.available()) {
    val = BT.read();
    Serial.print(val);
  }
  
}
