import sys
#-*- coding:utf-8 -*-  

# 0xA6-0xDF (58)
katakana = "ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟ"

subtitles = [
    ["", ""]
    ,["ﾅｶﾞﾚﾃｸ", "ﾄｷﾉﾅｶﾃﾞﾃﾞﾓ"]
    ,["ｹﾀﾞﾙｻｶﾞﾎﾗ", "ｸﾞﾙｸﾞﾙﾏﾜｯﾃ"]
    ,["ﾜﾀｼｶﾗ", "ﾊﾅﾚﾆｺｺﾛﾓ"]
    ,["ﾐｴﾅｲﾜ", "ｿﾜｼﾗﾅｲ?"]
    ,["ｼﾞﾌﾞﾝｶﾗ", "ｳｺﾞｸｺﾄﾓﾅｸ"]
    ,["ﾄｷﾉｽｷﾏﾆ", "ﾅｶﾞｻﾚﾂﾂﾞｹﾃ"]
    ,["ｼﾗﾅｲﾜ", "ﾏﾜﾘﾉｺﾛﾅﾄﾞ"]
    ,["ﾜﾀｼﾊﾀｼ", "ｿﾚﾀﾞｹ"]
    ,["ﾕﾒﾐﾃﾙ?", "ﾅﾆﾓﾐﾃﾅｲ?"]
    ,["ｶﾀﾙﾓﾑﾀﾞﾅ", "ｼﾞﾌﾞﾝﾉｺﾄﾊﾞ?"]
    ,["ｶﾅｼﾑﾅﾝﾃ", "ﾂｶﾚﾙﾀﾞｹﾖ"]
    ,["ﾅﾆﾓｶﾝｼﾞｽﾞ", "ｽｺﾞｾﾊﾞｲｲﾉ"]
    ,["ﾄﾏﾄﾞｳｺﾄﾊﾞ", "ｱﾀｴﾗﾚﾃﾓ"]
    ,["ｼﾞﾌﾞﾝﾉｺｺﾛ", "ﾀﾀﾞｳｴﾉｿﾗ"]
    ,["ﾓｼﾜﾀｼｶﾗ", "ｳｺﾞｸﾉﾅﾗﾊﾞ"]
    ,["ｽﾍﾞﾃｶｴﾙﾉﾅﾗ", "ｸﾛﾆｽﾙ"]
    ,["ｺﾝﾅｼﾞﾌﾞﾝﾆ", "ﾐﾗｲﾊｱﾙﾉ?"]
    ,["ｺﾝﾅｾｶｲﾆ", "ﾜﾀｼﾊｲﾙﾉ?"]
    ,["ｲﾏｾﾂﾅｲﾉ?", "ｲﾏｶﾅｼｲﾉ?"]
    ,["ｼﾞﾌﾞﾝﾉｺﾄﾓ", "ﾜｶﾗﾅｲﾏﾏ"]
    ,["ｱﾕﾑｺﾄｻｴ", "ﾂｶﾚﾙﾀﾞｹﾖ"]
    ,["ﾋﾄﾉｺﾄﾅﾄﾞ", "ｼﾘﾓｼﾅｲﾜ"]
    ,["ｺﾝﾅﾜﾀｼﾓ", "ｶﾜﾚﾙﾓﾅﾗ"]
    ,["ﾓｼｶﾜﾚﾙﾉﾅﾗ", "ｼﾛﾆﾅﾙ?"]
    ,["", ""]
    ,["ﾅｶﾞﾚﾃｸ", "ﾄｷﾉﾅｶﾃﾞﾃﾞﾓ"]
    ,["ｹﾀﾞﾙｻｶﾞﾎﾗ", "ｸﾞﾙｸﾞﾙﾏﾜｯﾃ"]
    ,["ﾜﾀｼｶﾗ", "ﾊﾅﾚﾆｺｺﾛﾓ"]
    ,["ﾐｴﾅｲﾜ", "ｿｳｼﾗﾅｲ?"]
    ,["ｼﾞﾌﾞﾝｶﾗ", "ｳｺﾞｸｺﾄﾓﾅｸ"]
    ,["ﾄｷﾉｽｷﾏﾆ", "ﾅｶﾞｻﾚﾂﾂﾞｹﾃ"]
    ,["ｼﾗﾅｲﾜ", "ﾏﾜﾘﾉｺﾄﾅﾄﾞ"]
    ,["ﾜﾀｼﾊﾜﾀｼ", "ｿﾚﾀﾞｹ"]
    ,["ﾕﾒﾐﾃﾙ?", "ﾅﾆﾓﾐﾃﾅｲ?"]
    ,["ｶﾀﾙﾓﾑﾀﾞﾅ", "ｼﾞﾌﾞﾝﾉｺﾄﾊﾞ?"]
    ,["ｶﾅｼﾑﾅﾝﾃ", "ﾂｶﾚﾙﾀﾞｹﾖ"]
    ,["ﾅﾆﾓｶﾝｼﾞｽﾞ", "ｽｺﾞｾﾊﾞｲｲﾉ"]
    ,["ﾄﾏﾄﾞｳｺﾄﾊﾞ", "ｱﾀｴﾗﾚﾃﾓ"]
    ,["ｼﾞﾌﾞﾝﾉｺｺﾛ", "ﾀﾀﾞｳｴﾉｿﾗ"]
    ,["ﾓｼﾜﾀｼｶﾗ", "ｳｺﾞｸﾉﾅﾗﾊﾞ"]
    ,["ｽﾍﾞﾃｶｴﾙﾉﾅﾗ", "ｸﾛﾆｽﾙ"]
    ,["ｳｺﾞｸﾉﾅﾗﾊﾞ", "ｳｺﾞｸﾉﾅﾗﾊﾞ"]
    ,["ｽﾍﾞﾃｺﾜｽﾜ", "ｽﾍﾞﾃｺﾜｽﾜ"]
    ,["ｶﾅｼﾑﾅﾗﾊﾞ", "ｶﾅｼﾑﾅﾗﾊﾞ"]
    ,["ﾜﾀｼﾉｺｺﾛ", "ｼﾛｸｶﾜﾚﾙ?"]
    ,["ｱﾅﾀﾉｺﾄﾓ", "ﾜﾀｼﾉｺﾄﾓ"]
    ,["ｽﾍﾞﾃﾉｺﾄﾓ", "ﾏﾀﾞｼﾗﾅｲﾉ"]
    ,["ｵﾓｲﾏﾌﾞﾀｦ", "ｱｹﾀﾉﾅﾗﾊﾞ"]
    ,["ｽﾍﾞﾃｺﾜｽﾉﾅﾗ", "ｸﾛﾆﾅﾚ!!"]
    ,["", ""]
]

ukatakana = katakana.decode('utf-8')
first_data = True
print("const uint8_t subtitles_table[][22] = {")
for i in range(0, len(subtitles)):
    sys.stdout.write("  ")
    if first_data:
        first_data = False
    else:
        sys.stdout.write(",")
    sys.stdout.write("{")
    k = 0
    for j in range(0, len(subtitles[i])):
        usubtitles = subtitles[i][j].decode('utf8')
        for s in usubtitles:
            index = ukatakana.find(s)
            if index < 0:
                sys.stdout.write("0x%x" % ord(s))
            else:
                sys.stdout.write("0x%x" % (0xA6 + index))
            if k < 21:
                sys.stdout.write(",")
            k = k + 1
        while k < 11 * j + 11:
            sys.stdout.write("0x20")
            if k < 21:
                sys.stdout.write(",")
            k = k + 1
    sys.stdout.write("}\n")
print("};")

