
%用于产生正弦数据表，输出到文件dac_sinWave.c 文件中，复制到c语言数组即可

n = 2*pi/32 : 2*pi/32 : 2*pi      %分成32等份

a = sin(n)+1;                     %求取sin函数值并向上平移一个单位，消除负数值
a = a * 3.3/2;                    %调整幅值，使范围限制为0~3.3   
r = a* (2.^12) /3.3               %求取dac数值，12位dac LSB = 3.3/2.^12 
r = uint16(r);                     %把double型数据转化成16位整型数据 

for i = 1:32                        
if r(i) > 4095                      %限制数据最大不超过4095
    r(i) = 4095
end
end 

dlmwrite('dac_sinWave.c',r);      %把数据写入到文件,方便添加到stm32工程中
plot(n,r,'.')                     %把这些点画出来 